# Begin 35
t1 = int(input("Введите время движения лодки по озеру (в стоячей воде) в часах:"))
t2 = int(input("Введите время движения лодки по реке (против течения) в часах:"))
v = int(input("Введите собственную скорость лодки в км/ч:"))
u = int(input("Введите скорость течения реки в км/ч:"))
if v > u:
    s = t1 * v + t2 * (v - u)
    print("Расстояние пройденое лодкой в км:", s)
else:
    print("Скорость лодки в озере не может быть меньше или равной скорости течения реки")
# Не уверен нужно ли оформлять в этих задачах исключения, как я читал, в любой программе по возможности стоит оформлять исключения



# Begin 7
r = int(input("Введите радиус круга:"))
pi = 3.14
L = 2 * pi * r
S = pi * r**2
print("Длина окружности L равна:", L)
print("Площадь заданного круга S равна:", S)



# Integer 4
A = int(input("Введите число A:"))
B = int(input("Введите число B:"))
k = A // B
print("Количество отрезков B, размещаемых на отрезке A равно:", k)



# Integer 17
n = int(input("Введите ваше число:"))
if n > 999:
    m = n // 100 % 10
    print("Цифра соответствующая разряду сотен из записи вашего числа:", m)
else:
    print("Число должно быть больше 999")
